# NeedsTwoToAlignEaves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DetailFailures..::..NeedsTwoToAlignEaves Property
BuiltInFailures..::..DetailFailures Class See Also
---
At least two Slope Defining Lines are needed to perform Align Eaves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NeedsTwoToAlignEaves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NeedsTwoToAlignEaves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NeedsTwoToAlignEaves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DetailFailures Class
Autodesk.Revit.DB Namespace